
/**
 * 
 * 数据结构：多维矩阵。
 * 
 * <p>
 * Object类型的知识存储在颞叶 使用多维矩阵模拟神经网络的存储知识图谱的研究
 * 
 * 知识 抽象概念与巨像信息之间的关系（多个一维/二维/三维，之间的关系）
 * 
 * Object 物体辨识 Action 概念与概念的关系
 * 
 * 
 * 
 * 概念本身是通过长时程增强而来（数据） 强化学习学的是概念与概念之间的关系（函数）如何表示？
 * 
 * A (相同/大于/小于/包含) B
 * 
 * 组成知识图谱。强化学习。
 * 
 * <h2>Object辨识</h2>
 * 
 * <p>
 * 语音（一维）文字（一维）图形（二维）图像（三维）
 * <h2>Object类型的知识存储在颞叶（长时程增强）</h2>
 * 
 * <p>
 * <h2>Time Series类型的知识存储在颞叶（情景记忆）</h2>
 * 
 * <p>
 * <h2>Action类型的知识存储在额叶（需要强化学习）</h2>
 * <p>
 * 
 *
 * 
 */
package winw.ai.memory;