package winw.ai.perception.visual;

public class PrimaryVisualCortex {

	/**
	 * 方位选择性（orientation selectivity）
	 * 所谓方位，也叫做“空间朝向”（orientation），指的是一条短线的倾斜角度（范围是0-180°，见下图）。
	 * <p>
	 * 初级视觉皮层细胞有一种重要的性质，就是“方位选择性”。换句话说，绝大部分初级视觉皮层细胞，都有一个“最喜欢的方位”（preferred
	 * orientation，中文习惯翻译成“最优方位”）。
	 * 给一个初级视觉皮层细胞看不同方位的短棒，当短棒的方位等于这个细胞的最优方位时，细胞的反应就达到最强。如果短棒的方位逐渐偏离最优方位，细胞的反应就越来越弱。如果短棒的方位和最优方位垂直，那么此时细胞的反应就达到最低点。
	 * 这样一来，我们就可以通过观察细胞的反应强弱变化，来得知这个细胞最喜欢哪个方位了。
	 * 初级视觉皮层细胞的上述性质，被称为“方位选择性”。类似的，还存在“运动方向选择性”、“空间频率/时间频率选择性”（很快会讲到）、“颜色选择性”等等。
	 * 这些选择性，本质上使得初级视觉皮层具备了检测并编码各种视觉特征的能力。
	 * 
	 * <p>
	 * https://zhuanlan.zhihu.com/p/134596480
	 */
	public void orientationSelectivity() {

	}

}
